In [1]:
# import numpy
import numpy as np

In [2]:
#Importing Pandas library.
import pandas as pd

In [4]:
d = {'a':1,'b':2,'c':3}
ser = pd.Series(data=d)
ser

a    1
b    2
c    3
dtype: int64

In [5]:
d= {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['a', 'y', 'c'])
ser

a    1.0
y    NaN
c    3.0
dtype: float64

In [7]:
I=['banana', 42]
s = pd.Series(data=I)
print(s)

0    banana
1        42
dtype: object

In [8]:
s = pd.Series(['banana', 42], index=['a','b'])
print(s)

a    banana
b        42
dtype: object

In [10]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'],index=['Person', 'Who'])
print(s)

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [12]:
# Creating a list of prices.
pricelist=[100,200,300,400]

#Creating a series.
productseries=pd.Series(pricelist)

#Displaying the series.
print(productseries)

0    100
1    200
2    300
3    400
dtype: int64

In [14]:
d = {'col1': [1,2], 'col2': [3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
scientists = pd.DataFrame({
'Name': ['Rosaline Franklin','William Gosset'],
'Occupation': ['Chemist', 'Statistician'],
'Born':['1920-07-25', '1876-06-13'],
'died': ['1958-04-16', '1937-10-16'],
'Age': [37,61]})
print(scientists)

                Name    Occupation        Born        died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [17]:
productdf = pd.DataFrame([[100,200,300,400],[4,2,5,6]],columns=['Pen', 'Shirt', 'Book', 'Mouse'])
print(productdf)

   Pen  Shirt  Book  Mouse
0  100    200   300    400
1    4      2     5      6

In [21]:
productdf.shape

(2, 4)

In [22]:
productdf.size

8

In [23]:
productdf.keys()

Index(['Pen', 'Shirt', 'Book', 'Mouse'], dtype='object')

In [24]:
productdf.columns

Index(['Pen', 'Shirt', 'Book', 'Mouse'], dtype='object')

In [25]:
productdf["Mobile"] =[15000,2]
productdf

   Pen  Shirt  Book  Mouse  Mobile
0  100    200   300    400   15000
1    4      2     5      6       2

In [26]:
df2 = productdf.drop("Mobile",axis=1)
df2

   Pen  Shirt  Book  Mouse
0  100    200   300    400
1    4      2     5      6

In [27]:
df2 = productdf.drop(columns= ["Mobile"])
df2

   Pen  Shirt  Book  Mouse
0  100    200   300    400
1    4      2     5      6

In [28]:
df2 = productdf.drop(columns= ["Mobile",'Book'])
df2

   Pen  Shirt  Mouse
0  100    200    400
1    4      2      6

In [29]:
productdf = productdf.drop(columns= ["Mobile"])
productdf

   Pen  Shirt  Book  Mouse
0  100    200   300    400
1    4      2     5      6

In [30]:
df3=df2.drop(index=[0])
df3

   Pen  Shirt  Mouse
1    4      2      6